# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip = input('Введите адрес/маску в формате 10.1.1.0/24:')
ip_mask = ip.split('/')
addr = str(ip_mask[0])
oct1, oct2, oct3, oct4 = addr.split('.')
mask = int(ip_mask[1])
print('Network:')
print(f'{oct1:8}  {oct2:8}  {oct3:8}  {oct4:8}')
print(f'{int(oct1):08b}  {int(oct2):08b}  {int(oct3):08b}  {int(oct4):08b}')
print('\nMask:')
print(f'/{mask}')
mask_bin = mask * '1' + '0' * (32 - mask)
oct11, oct12, oct13, oct14 = mask_bin[0:8], mask_bin[8:16], mask_bin[16:24], mask_bin[24:]
print(f'{int(oct11, 2):<8}  {int(oct12, 2):<8}  {int(oct13, 2):<8}  {int(oct14, 2):<8}')
print(f'{oct11:8}  {oct12:8}  {oct13:8}  {oct14:8}')

